Tekla.Structures.Model.ISharingResult`1
Represents the result of a sharing operation, including the result code and associated data.
The type of data associated with the sharing operation.

Tekla.Structures.Model.ISharingResult`1.Data
Gets the data associated with the sharing operation.